# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [285]:
import pandas as pd
df_data = pd.read_csv(r"D:\CODING\DEPI\PANDAS\Task 2\Data\Purchase_Data.csv")
df_data = pd.DataFrame(df_data)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [286]:
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [287]:
result_1 = df_data.loc[:,'invoice_number':'invoice_time']
result_1.head()

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [288]:
result_2 = df_data.loc[0:1,:]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [289]:
result_3 = df_data.loc[0:3,'invoice_number':'category_id']
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [290]:
result_4 = df_data.loc[[0,4,6],['invoice_time','price']]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [291]:
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [292]:
df_data.iloc[num_rows-1:,:]

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [293]:
avg_price = df_data['price'].mean()
print(avg_price)
max_price = df_data['price'].max()
print(max_price)

3.1920522110741363
6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [294]:
avg_price, avg_num = df_data[['price', 'num_item']].mean()

print(avg_price)
print(avg_num)

3.1920522110741363
1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [295]:
df_data['total'] = df_data['price'] * df_data['num_item']
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [296]:
three_most = df_data.sort_values(by='price', ascending=False).head(3)['price'].mean()
print(three_most)

6.003333333333333

How many different products are there?

In [297]:
n = df_data['product_id'].nunique()
n

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [298]:
describe = df_data['total'].describe()
diff = describe['mean'] - describe['50%']
print(diff)

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [299]:
df_data = df_data.drop(labels='total',axis=1)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [300]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [301]:

df_data['datetime'] = pd.to_datetime(df_data['invoice_time'])
df_data.head()

C:\Users\mazen\AppData\Local\Temp\ipykernel_19172\1776922951.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['datetime'] = pd.to_datetime(df_data['invoice_time'])

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,datetime
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2015-07-15 10:45:00
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2015-07-15 12:16:00
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2015-07-15 12:16:00
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,2015-07-15 12:16:00
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,2015-07-15 12:16:00

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [302]:
df_data['DOW'] = df_data['datetime'].dt.day_name()
df_data['Month'] = df_data['datetime'].dt.month_name()
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,datetime,DOW,Month
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2015-07-15 10:45:00,Wednesday,July
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2015-07-15 12:16:00,Wednesday,July
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2015-07-15 12:16:00,Wednesday,July
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,2015-07-15 12:16:00,Wednesday,July
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,2015-07-15 12:16:00,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [303]:
n = df_data['DOW'].value_counts()
num_purchases_wed = n['Wednesday']
print(num_purchases_wed)

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [304]:
data = pd.read_csv(r'D:\CODING\DEPI\PANDAS\Task 2\Data\Titanic.csv')
df_titanic = pd.DataFrame(data)
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [305]:
df_titanic.rename({'Name':'Passenger_Name','Ticket':'Ticket_Num'},axis=1,inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [306]:
df_titanic.set_index('PassengerId',inplace=True)
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [307]:
name = df_titanic.loc[896,'Passenger_Name']
print(name)

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [308]:
df_titanic.reset_index(inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [309]:
null = df_titanic['Age'].isnull().sum()
print(null)

86

Compute the avg age of passengers ignoring the missing data.

In [310]:
average_age = df_titanic['Age'].mean()
print(average_age)

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [311]:
df_titanic['Age'] = df_titanic['Age'].fillna(df_titanic['Age'].mean())

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [312]:
oldest_passengers = df_titanic.sort_values(by="Age", ascending=False).reset_index()
average_age_oldest_5 = oldest_passengers["Age"].head(5).mean()
print(average_age_oldest_5)

67.0